## [View Run #10 ](https://github.com/Jaee-C/grocery-prices/actions/runs/13111008754)

| Summary       | Result        |
| ------------- |:-------------:|
| 🚀 Run         | [View Run - 729b4c3 / 10](https://github.com/Jaee-C/grocery-prices/actions/runs/13111008754) |
| 🖌 Format and Style  | ✅  |
| ⚙️ Initialization  | ✅ |
| 🤖 Validation    | ✅    |
| 📖 Plan     | ✅    |

<details><summary>🤖 Validation Output </summary>

```hcl
Success! The configuration is valid.
```

</details>

#### 📖Terraform Plan - ✅

<details><summary>Show Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.lambda_invoke_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_invoke_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "InvokeLambda"
        }
    }

  # aws_cloudwatch_event_rule.fetch_grocery_prices will be created
  + resource "aws_cloudwatch_event_rule" "fetch_grocery_prices" {
      + arn                 = (known after apply)
      + description         = "Fetch grocery prices every Wednesday"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "fetch_grocery_prices"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 8 * * 4 *)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_target.fetch_grocery_prices_target will be created
  + resource "aws_cloudwatch_event_target" "fetch_grocery_prices_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "fetch_grocery_prices"
      + target_id      = (known after apply)
    }

  # aws_dynamodb_table.grocery_items will be created
  + resource "aws_dynamodb_table" "grocery_items" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "code"
      + id               = (known after apply)
      + name             = "grocery_items"
      + range_key        = "merchant"
      + read_capacity    = 5
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = 5

      + attribute {
          + name = "code"
          + type = "S"
        }
      + attribute {
          + name = "merchant"
          + type = "S"
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

  # aws_dynamodb_table.grocery_prices will be created
  + resource "aws_dynamodb_table" "grocery_prices" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "code-merchant"
      + id               = (known after apply)
      + name             = "grocery_prices"
      + range_key        = "date"
      + read_capacity    = 5
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = 5

      + attribute {
          + name = "code-merchant"
          + type = "S"
        }
      + attribute {
          + name = "date"
          + type = "S"
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

  # aws_ecrpublic_repository.grocery_prices will be created
  + resource "aws_ecrpublic_repository" "grocery_prices" {
      + arn             = (known after apply)
      + force_destroy   = false
      + id              = (known after apply)
      + registry_id     = (known after apply)
      + repository_name = "grocery-prices"
      + repository_uri  = (known after apply)
      + tags_all        = (known after apply)

      + catalog_data {
          + about_text        = "Lambda functions to search grocery prices"
          + architectures     = [
              + "x86-64",
            ]
          + description       = "Lambda functions to search grocery prices"
          + logo_image_blob   = (known after apply)
          + operating_systems = [
              + "Linux",
            ]
          + usage_text        = "Should not be used by anyone, no idea if it actually works"
        }
    }

  # aws_ecrpublic_repository_policy.public_ecr will be created
  + resource "aws_ecrpublic_repository_policy" "public_ecr" {
      + id              = (known after apply)
      + policy          = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr-public:UploadLayerPart",
                          + "ecr-public:PutImage",
                          + "ecr-public:InitiateLayerUpload",
                          + "ecr-public:CompleteLayerUpload",
                          + "ecr-public:BatchCheckLayerAvailability",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "340752823750"
                        }
                      + Sid       = "new policy"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + registry_id     = (known after apply)
      + repository_name = "grocery-prices"
    }

  # aws_iam_policy.execution_policy will be created
  + resource "aws_iam_policy" "execution_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "grocery_lambda_execution_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "kms:GenerateDataKey",
                          + "kms:Decrypt",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "KmsAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role.grocery_lambda_execution_role will be created
  + resource "aws_iam_role" "grocery_lambda_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "grocery_lambda_execution_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.grocery_lambda_execution_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "grocery_lambda_execution_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "grocery_lambda_execution_role"
    }

  # aws_lambda_permission.cloudwatch_events_invoke will be created
  + resource "aws_lambda_permission" "cloudwatch_events_invoke" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "search_grocery_prices"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromCloudWatch"
      + statement_id_prefix = (known after apply)
    }

  # module.lambdas.aws_lambda_function.add_grocery_item will be created
  + resource "aws_lambda_function" "add_grocery_item" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "add_grocery_item"
      + id                             = (known after apply)
      + image_uri                      = "test"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.13"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + image_config {
          + command = [
              + "grocery_prices.handlers.add_grocery_item.lambda_handler",
            ]
        }
    }

  # module.lambdas.aws_lambda_function.remove_grocery_item will be created
  + resource "aws_lambda_function" "remove_grocery_item" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "remove_grocery_item"
      + id                             = (known after apply)
      + image_uri                      = "test"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.13"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + image_config {
          + command = [
              + "grocery_prices.handlers.remove_grocery_item.lambda_handler",
            ]
        }
    }

  # module.lambdas.aws_lambda_function.save_price will be created
  + resource "aws_lambda_function" "save_price" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "save_price"
      + id                             = (known after apply)
      + image_uri                      = "test"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.13"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + image_config {
          + command = [
              + "grocery_prices.handlers.save_price.lambda_handler",
            ]
        }
    }

  # module.lambdas.aws_lambda_function.search_grocery_prices will be created
  + resource "aws_lambda_function" "search_grocery_prices" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "search_grocery_prices"
      + id                             = (known after apply)
      + image_uri                      = "test"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.13"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + image_config {
          + command = [
              + "grocery_prices.handlers.save_price.lambda_handler",
            ]
        }
    }

Plan: 14 to add, 0 to change, 0 to destroy.
```
</details>

- [ ] Plan Reviewed

*Author: @Jaee-C, Action: `pull_request`, Working Directory: `infra` , Workflow: `Terraform Plan`*
<!-- Sticky Pull Request CommentChange Summary -->